from indic_transliteration import sanscript
import re

conso={
    "क": "क्",
    "ख": "ख्",
    "ग": "ग्",
    "घ": "घ्",
    "ङ": "ङ्",
    "च": "च्",
    "छ": "छ्",
    "ज": "ज्",
    "झ": "झ्",
    "ञ": "ञ्",
    "ट": "ट्",
    "ठ": "ठ्",
    "ड": "ड्",
    "ढ": "ढ्",
    "ण": "ण्",
    "त": "त्",
    "थ": "थ्",
    "द": "द्",
    "ध": "ध्",
    "न": "न्",
    "प": "प्",
    "फ": "फ्",
    "ब": "ब्",
    "भ": "भ्",
    "म": "म्",
    "य": "य्",
    "र": "र्",
    "ल": "ल्",
    "व": "व्",
    "श": "श्",
    "ष": "ष्",
    "स": "स्",
    "ह": "ह्",
    "ळ": "ळ्",
    "क्ष": "क्ष्",
    "त्र": "त्र्",
    "ज्ञ": "ज्ञ्",
}

old_alpha={
    #vowels
        "अ": "अ",
        "आ": "आ",
        "इ": "इ",
        "ई": "ई",
        "उ": "उ",
        "ऊ": "ऊ",
        "ऋ": "ॠ्",
        "ॠ": "ॠ",
        "ऌ": "ऌ",
        "ॡ": "ॡ",
        "ऎ": "ऎ",
        "ए": "ए",
        "ऐ": "ऐ",
        "ऒ": "ऒ",
        "ओ": "ओ",
        "औ": "औ",
        "ऍ": 'अं',
        "ऑ": "ऑ",
        'ॲ':'अं',
    #vowel_marks
        "ा": "आ",
        'ि': 'इ',
        'ी': 'ई',
        'ु': 'उ',
        'ू': 'ऊ',
        "ृ": "ॠ्",
        "ॄ": "ॄ",
        "ॢ": "ॢ",
        "ॣ": "ॣ",
        "ॆ": "ऎ",
        "े": "ए",
        "ै": "ऐ",
        "ॊ": "ऒ",
        "ो": "ओ",
        "ौ": "औ",
        "ॅ": 'अं',
        "ॉ": "ॉ",
        '़':'़',
    #yogavaahas
        "ं": 'अं',
        "ः": "ह्",
        "ँ": 'अं',
        "ᳵ": "ᳵ",
        "ᳶ": "ᳶ",
        "ꣳ": "ꣳ",
    
    #virama
        "्": "्",
    
    
    #symbols
        "०": "०",
        "१": "१",
        "२": "२",
        "३": "३",
        "४": "४",
        "५": "५",
        "६": "६",
        "७": "७",
        "८": "८",
        "९": "९",
        "ॐ": "ॐ",
        "ऽ": "ऽ",
        "।": "।",
        "॥": "॥",
    
    #zwj
        "\u200d": "\u200d",
    
    #zwnj
        "\u200c": "\u200c",
    
    #skip
        "": "",
    
    #accents
        "॑": "॑",
        "᳚": "᳚",
        "॒": "॒",
        "᳒": "᳒",
        "᳡": "᳡",
        "꣡": "꣡",
        "꣢": "꣢",
        "꣣": "꣣",
        "꣤": "꣤",
        "꣥": "꣥",
        "꣦": "꣦",
        "꣧": "꣧",
        "꣨": "꣨",
        "꣩": "꣩",
        "꣪": "꣪",
        "꣫": "꣫",
        "꣬": "꣬",
        "꣭": "꣭",
        "꣮": "꣮",
        "꣯": "꣯",
        "꣰": "꣰",
        "꣱": "꣱",
        "᳝": "᳝",
        "᳸": "᳸",
    
    #candra
        "ॅ": "र्",
    
    #extra_consonants
        "क़": "क़",
        "ख़": "ख़",
        "ग़": "ग़",
        "ज़": "ज़",
        "ड़": "ण्",
        "ढ़": "ण्",
        'ढ़':"ण्",
        "फ़": "फ़",
        "य़": "य़",
        "ऱ": "ऱ",
        "ऴ": "ऴ",
        "ऩ": "ऩ",
    
    #alternates
        "क़": ["क़"],
        "ख़": ["ख़"],
        "फ़": ["फ़"],
        "ज़": ["ज़"],
        "ऩ": ["ऩ"],
        "ड़": ["ड़"],
        "ग़": ["ग़"],
        "ढ़": ["ढ़"],
        "य़": ["य़"],
        "ऱ": ["ऱ"],
        "ऴ": ["ऴ"],
    
    #symbols
        '-': '-',
    ',': ',',
    '.': '.',
    ':': ':',
    ';': ';',
    '!': '!',
    '?': '?',
    "'": "'",
    '"': '"',
    '`': '`',
    '~': '~',
    '@': '@',
    '#': '#',
    '$': '$',
    '%': '%',
    '^': '^',
    '&': '&',
    '*': '*',
    '_': '_',
    '|': '|',
    '\\': '\\',
    '/': '/',
    '<': '<',
    '>': '>',
    '=': '=',
    '+': '+',
    '(': '(',
    ')': ')',
    '[': '[',
    ']': ']',
    '{': '{',
    '}': '}',
    '।':'।',
    '|':'|',
    '”':'”',
    '‘':'‘',
    '—':'—',
     '’': '’',
    '…':'…',
    '“':'“',
    '–':'–',
    '•':'•',
    'ॽ':'ॽ',
    '॰':'॰',
    
    
}

alpha={
    #vowels
        "अ": "अ",
        "आ": "आ",
        "इ": "इ",
        "ई": "ई",
        "उ": "उ",
        "ऊ": "ऊ",
        "ऋ": "ॠ्",
        "ॠ": "ॠ",
        "ऌ": "ऌ",
        "ॡ": "ॡ",
        "ऎ": "ऎ",
        "ए": "ए",
        "ऐ": "ऐ",
        "ऒ": "ऒ",
        "ओ": "ओ",
        "औ": "औ",
        "ऍ": 'अं',
        "ऑ": "ऑ",
        'ॲ':'अं',
    #vowel_marks
        "ा": "आ",
        'ि': 'इ',
        'ी': 'ई',
        'ु': 'उ',
        'ू': 'ऊ',
        "ृ": "ॠ्",
        "ॆ": "ऎ",
        "े": "ए",
        "ै": "ऐ",
        "ॊ": "ऒ",
        "ो": "ओ",
        "ौ": "औ",
        "ॅ": 'अं',
        "ॉ": "ॉ",
        '़':'़',
    #yogavaahas
        "ं": 'अं',
        "ः": "ह्",
        "ँ": 'अं',
    
    #virama
        "्": "्",
    
    
    #symbols
        "०": "०",
        "१": "१",
        "२": "२",
        "३": "३",
        "४": "४",
        "५": "५",
        "६": "६",
        "७": "७",
        "८": "८",
        "९": "९",
        "ॐ": "ॐ",
        "ऽ": "ऽ",
        "।": "।",
        "॥": "॥",
    
    #zwj
        "\u200d": "\u200d",
    
    #zwnj
        "\u200c": "\u200c",
    
    #candra
        "ॅ": "र्",
    
    #extra_consonants
        "क़": "क़",
        "ख़": "ख़",
        "ग़": "ग़",
        "ज़": "ज़",
        "ड़": "ण्",
        "ढ़": "ण्",
        'ढ़':"ण्",
        "फ़": "फ़",
        "य़": "य़",
        "ऱ": "ऱ",
        "ऴ": "ऴ",
        "ऩ": "ऩ",
    
    
    
}

devanagari_pattern = re.compile(r'[^\u0900-\u097F]+')

def correction(ab):
    
    ab = devanagari_pattern.sub(' ', ab)
    ab=sanscript.transliterate(ab,sanscript.ITRANS,sanscript.DEVANAGARI)
    out=['-']
    for a in ab:
        #print(a)
        if a in conso.keys():
            out.append(conso[a])
            out.append("अ")
        else:
            if a==' 'or a=='\n':
                out.append(a)
            elif a not in alpha:
                continue
            elif out[-1] =="अ":
                out[-1]=alpha[a]
            else:
                out.append(alpha[a])
        #print(out[-1])
        #print(out)


    for index,a in enumerate(out):
        if a=='्':
            del out[index]
            if out[index-1]=="अ":
                del out[index-1]

    del out[0]

    return out


print(correction('प्रशासन गिरफ्तार'))